content-org/all-posts.org
#+hugo_base_dir: ../

* DONE Using variables in rgee                                             :rgee:
CLOSED: [2024-08-13 Tue 11:37]
:PROPERTIES:
:EXPORT_FILE_NAME: using-variables-in-rgee
:END:
** Introduction

Google Earth Engine provides access to a bunch of geospatial datasets including satellite imagery, climate data and land cover classifications. These datasets, known as variables, are used to perform geospatial analyses.

** Calling variables
/Load and initialize rgee first!/

Define an area that you want to visualize. The easiest way of doing this is to define a rectangle with coordinates.

#+begin_src R
aoi <- ee$Geometry$Rectangle(c(-120.4, 34.5, -119.4, 35.5))
#+end_src

In this example, I'll use the MODIS land cover datasets.

#+begin_src R
landcover <- ee$ImageCollection("MODIS/061/MCD12Q1")$first()$select("LC_Type1")
#+end_src

Set some visualization parameters to control how the data is displayed.

#+begin_src R
landcover_viz <- list(
  min = 1,
  max = 17,
  palette = c("05450a", "086a10", "54a708", "78d203", "009900",
              "c6b044", "dcd159", "dade48", "fbff13", "b6ff05",
              "27ff87", "c24f44", "a5a5a5", "ff6d4c", "69fff8",
              "f9ffa4", "1c0dff")
)
#+end_src

Center the map on the area we are interested in, and add in the land cover layer using the parameters we defined above.

#+begin_src R
Map$centerObject(aoi,8)
Map$addLayer(landcover, landcover_viz, "Land Cover :)")
#+end_src
